cmu-jollyroger/jr-stm32-rtos/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */
extern I2C_HandleTypeDef hi2c1;
extern I2C_HandleTypeDef hi2c3;
/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define VL53L1X_INT_Pin GPIO_PIN_4
#define VL53L1X_INT_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA

#define TOF_XSHUT_0_Pin GPIO_PIN_10
#define TOF_XSHUT_0_GPIO_Port GPIOC
#define TOF_XSHUT_1_Pin GPIO_PIN_12
#define TOF_XSHUT_1_GPIO_Port GPIOC
#define TOF_XSHUT_2_Pin GPIO_PIN_15
#define TOF_XSHUT_2_GPIO_Port GPIOA
#define TOF_XSHUT_3_Pin GPIO_PIN_5
#define TOF_XSHUT_3_GPIO_Port GPIOB
#define TOF_XSHUT_4_Pin GPIO_PIN_3
#define TOF_XSHUT_4_GPIO_Port GPIOB
#define TOF_XSHUT_5_Pin GPIO_PIN_10
#define TOF_XSHUT_5_GPIO_Port GPIOA

#define LIMIT_SW_L_Pin GPIO_PIN_6
#define LIMIT_SW_L_GPIO_Port GPIOB
#define LIMIT_SW_R_Pin GPIO_PIN_7
#define LIMIT_SW_R_GPIO_Port GPIOC
#define BUZZER_Pin GPIO_PIN_6
#define BUZZER_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
